Delans-TLE/src/Documents/ES_Поставка/ES_Поставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_Поставка</name>
  <registerRecords>AccumulationRegister.ES_Поставка</registerRecords>
  <registerRecords>InformationRegister.ES_СведенияОЗаказах</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ES_CarriageID</name>
    <comment>Идентификатор перевозки, в которой находится отправление в текущий момент</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ES_CarriageBarcode</name>
    <comment>Штрихкод перевозки, в которой находится отправление в текущий момент</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ES_ЗагруженССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВхНакладная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/AccumulationRegisters/ES_Поставка/ES_Поставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ES_Поставка</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Delans-TLE/src/InformationRegisters/ES_СведенияОЗаказах/ES_СведенияОЗаказах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_СведенияОЗаказах</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПланДоставки</name>
    <type>
      <types>DocumentRef.ES_ПланДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ОтчетОДоставке</name>
    <type>
      <types>DocumentRef.ES_ОтчетОДоставке</types>
    </type>
  </resources>
  <resources>
    <name>Выдача</name>
    <type>
      <types>DocumentRef.ES_Самовывоз</types>
    </type>
  </resources>
  <resources>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ES_Возвраты</types>
    </type>
  </resources>
  <resources>
    <name>Поставка</name>
    <type>
      <types>DocumentRef.ES_Поставка</types>
    </type>
  </resources>
  <resources>
    <name>Приемка</name>
    <type>
      <types>DocumentRef.ES_Приемка</types>
    </type>
  </resources>
  <resources>
    <name>ПеремещениеЗаказов</name>
    <type>
      <types>DocumentRef.ES_ПеремещениеЗаказов</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Documents/ES_Поставка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
		
	Движения.ES_Поставка.Записывать = Истина;
	ТабСведенияОЗаказе 	= ES_ФормированиеДвиженийПоРегистрамДоставки.СоздатьТаблицуСведенийОЗаказах();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ES_ПоставкаЗаказы.Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ES_Поставка.Заказы КАК ES_ПоставкаЗаказы
	|ГДЕ
	|	ES_ПоставкаЗаказы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ЕСТЬNULL(ES_ПоставкаОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ES_Поставка.Остатки(
	|				&Дата,
	|				Заказ В
	|					(ВЫБРАТЬ
	|						ВТ_Заказы.Заказ
	|					ИЗ
	|						ВТ_Заказы КАК ВТ_Заказы)) КАК ES_ПоставкаОстатки
	|		ПО ВТ_Заказы.Заказ = ES_ПоставкаОстатки.Заказ";	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоОстаток > 0 Тогда
			Сообщить("По документу "+Выборка.Заказ+ " уже сформирован документ поставки"); 
			Отказ = Истина;
		Иначе
			
			Движение = Движения.ES_Поставка.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Заказ = Выборка.Заказ;
			Движение.Количество = 1;
			
			// РС ES_СведенияОЗаказах - заполнение таблицы
			НоваяСтрока = ТабСведенияОЗаказе.Добавить();
			НоваяСтрока.Движения 		= Движения.ES_СведенияОЗаказах;
			НоваяСтрока.Период 			= Дата;//ПериодПроведения;
			НоваяСтрока.Регистратор 	= Ссылка;
			НоваяСтрока.Заказ 			= Выборка.Заказ;
			НоваяСтрока.Поставка	 	= Ссылка;

			
		КонецЕсли;
		
		
	КонецЦикла;
	
	  // РС ES_СведенияОЗаказах
		ES_ФормированиеДвиженийПоРегистрамДоставки.СделатьЗаписьВРССведенияОЗаказах(ТабСведенияОЗаказе, Дата);//ПериодПроведения);
				

	
	
КонецПроцедуры
